app/controllers/trades_controller.rb

SELECT "trades".* FROM "trades"
---
  def index
    @trades = Trade.all

INSERT INTO "trades" ("epic", "number_of_shares", "price", "book_value", "created_at", "updated_at", "user_id", "trade_type", "exchange") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @trade = @current_user.trades.new(trade_params)

    if @trade.save